In [2]:
# pandas are used to manipultate the data.

In [4]:
# pandas ====> open source library that is used for handle data manipulatinos

In [6]:
# data structure of pandas====>
# 1. series====> it is used for one dimensional data. it shown only values of a column and it will not include column name.
# 2. dataframe ====> it is multidimensiona; data. it shows column name with values.

In [7]:
import pandas as pd

In [9]:
a=pd.Series([1,34,78,90])
a

0     1
1    34
2    78
3    90
dtype: int64

In [10]:
type(a)

pandas.core.series.Series

In [13]:
# 2. dataframes ====>

In [14]:
a={
    "Emp_ID" : [1,2,3,4,5,6,7,8],
    "Name" : ['Sam' , 'Rahul' , 'Gorav' , 'Aniket', 'Anjali', 'Ria', 'Muskan','Pooja'],
    "Department" : ['IT', 'HR','Sales','IT','IT','Sales','IT','HR'],
    "Salary" : [25000,27000,23000,30000,32000,35000,28000,25000],
    "Workung_hours" :[8,9,8,9,7,6,7,8]
}

In [15]:
type(a)

dict

In [16]:
a

{'Emp_ID': [1, 2, 3, 4, 5, 6, 7, 8],
 'Name': ['Sam',
  'Rahul',
  'Gorav',
  'Aniket',
  'Anjali',
  'Ria',
  'Muskan',
  'Pooja'],
 'Department': ['IT', 'HR', 'Sales', 'IT', 'IT', 'Sales', 'IT', 'HR'],
 'Salary': [25000, 27000, 23000, 30000, 32000, 35000, 28000, 25000],
 'Workung_hours': [8, 9, 8, 9, 7, 6, 7, 8]}

In [18]:
df=pd.DataFrame(a)
df

   Emp_ID    Name Department  Salary  Workung_hours
0       1     Sam         IT   25000              8
1       2   Rahul         HR   27000              9
2       3   Gorav      Sales   23000              8
3       4  Aniket         IT   30000              9
4       5  Anjali         IT   32000              7
5       6     Ria      Sales   35000              6
6       7  Muskan         IT   28000              7
7       8   Pooja         HR   25000              8

In [19]:
# how to check top 5 data from a dataframe?

In [21]:
df.head() # it gives by default top 5 values

   Emp_ID    Name Department  Salary  Workung_hours
0       1     Sam         IT   25000              8
1       2   Rahul         HR   27000              9
2       3   Gorav      Sales   23000              8
3       4  Aniket         IT   30000              9
4       5  Anjali         IT   32000              7

In [22]:
df.head(2)

   Emp_ID   Name Department  Salary  Workung_hours
0       1    Sam         IT   25000              8
1       2  Rahul         HR   27000              9

In [23]:
# how to check bottom data

In [27]:
df.tail()

   Emp_ID    Name Department  Salary  Workung_hours
3       4  Aniket         IT   30000              9
4       5  Anjali         IT   32000              7
5       6     Ria      Sales   35000              6
6       7  Muskan         IT   28000              7
7       8   Pooja         HR   25000              8

In [28]:
df.tail(2)

   Emp_ID    Name Department  Salary  Workung_hours
6       7  Muskan         IT   28000              7
7       8   Pooja         HR   25000              8

In [29]:
# how can we check random indexed data?

In [31]:
df.sample(3)

   Emp_ID    Name Department  Salary  Workung_hours
7       8   Pooja         HR   25000              8
5       6     Ria      Sales   35000              6
3       4  Aniket         IT   30000              9

In [32]:
# how to sexport our data?

In [33]:
df.to_csv("C:\\Users\\deves\\Desktop\\advance\\Emp_Info.csv")

In [34]:
# step-1 (def.to_csv(" "))

# st Create a new folder ==> copy location ==> paste it into step-1
# df.to_csv("folder_locatio\\filename.csv")

In [35]:
# instant data scrapper